Merge resolved conflicts
